src/SSL.Chat2Desk/src/InformationRegisters/C2D_ОповещенияОператоров/C2D_ОповещенияОператоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ОповещенияОператоров</name>
  <resources>
    <name>Оповещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Диалоги/C2D_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Диалоги</name>
  <resources>
    <name>state</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>transport</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Сообщения/C2D_Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Сообщения</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>dialog_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_ОповещенияОператоров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьИнофрмациюОбОповещениях(IdСообщения, operator_id, ТрансферДиалога=Ложь) Экспорт
	СтруктураПараметровМетода = новый Структура("IdСообщения, operator_id, ТрансферДиалога", IdСообщения, operator_id, ТрансферДиалога);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(новый УникальныйИдентификатор);
	ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.C2D_ОповещенияОператоров.ОбновитьИнофрмациюОбОповещенияхВФоне", СтруктураПараметровМетода, ПараметрыВыполнения);	
КонецПроцедуры

//Вынесено в фон, чтобы в последствии можно было реализовать логику по побору пользователей для оповещений и она могла занимать больше времени и не задерживала бы получение http-response
Процедура ОбновитьИнофрмациюОбОповещенияхВФоне(СтруктураПараметров, АдресВХ) экспорт
	//Пока если пользователь неопределен, то ставим заглушку. В последствии сделаем регистр настроек получения оповещений, где будем хранить тех кто получает сообщения и параметры.
	Запись = РегистрыСведений.C2D_ОповещенияОператоров.СоздатьМенеджерЗаписи();
	Запись.IDСообщения = СтруктураПараметров.IdСообщения;
	Запись.Operator_id = СтруктураПараметров.operator_id;
	Запись.Прочитать();
	Запись.IDСообщения = СтруктураПараметров.IdСообщения;
	Запись.Operator_id = СтруктураПараметров.operator_id;
	Если СтруктураПараметров.трансферДиалога Тогда
		Запись.Оповещен=ложь;
	КонецЕсли;  
	
	запись.Записать();
КонецПроцедуры

Процедура СообщениеДоставлено(IdСообщения, operator_id) экспорт
	Запись = РегистрыСведений.C2D_ОповещенияОператоров.СоздатьМенеджерЗаписи();
	Запись.IDСообщения = IdСообщения;
	Запись.Operator_id = operator_id;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Оповещен = истина;
		Запись.Записать(); 
	КонецЕсли;
КонецПроцедуры

Процедура БеседаПрочитанаВФоне(СтруктураПараметров, АдресВХ) экспорт
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	C2D_ОповещенияОператоров.IDСообщения КАК IDСообщения,
	               |	C2D_ОповещенияОператоров.Operator_id КАК Operator_id
	               |ИЗ
	               |	РегистрСведений.C2D_Диалоги КАК C2D_Диалоги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Сообщения КАК C2D_Сообщения
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
	               |			ПО C2D_Сообщения.Id = C2D_ОповещенияОператоров.IDСообщения
	               |		ПО C2D_Диалоги.id = C2D_Сообщения.dialog_id
	               |ГДЕ
	               |	C2D_ОповещенияОператоров.Operator_id = &operator_id
	               |	И C2D_Диалоги.id = &dialog_id
	               |	И НЕ C2D_ОповещенияОператоров.Прочитано";
				   ЗАпрос.УстановитьПараметр("operator_id", структураПараметров.operator_id);
				   ЗАпрос.УстановитьПараметр("dialog_id", структураПараметров.dialog_id);
	Выборка = запрос.Выполнить().Выбрать();			   
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.C2D_ОповещенияОператоров.СоздатьМенеджерЗаписи();
		Запись.IDСообщения = Выборка.IdСообщения;
		Запись.Operator_id = Выборка.operator_id;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Прочитано = истина;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОповеститьОператораОДиалоге(operator_id, dialog_id, ТрансферДиалога = Ложь) экспорт
	IdСообщения = РегистрыСведений.C2D_Сообщения.НайтиПоследнееСообщениеВДиалоге(dialog_id);
	ОбновитьИнофрмациюОбОповещениях(IdСообщения, operator_id, ТрансферДиалога);
КонецПроцедуры

Процедура УдалитьУстаревшиеОповещения() экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	C2D_ОповещенияОператоров.IDСообщения КАК IDСообщения,
	               |	C2D_ОповещенияОператоров.Operator_id КАК Operator_id
	               |ИЗ
	               |	РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
	               |ГДЕ
	               |	C2D_ОповещенияОператоров.Оповещен = ИСТИНА
	               |	И C2D_ОповещенияОператоров.Прочитано = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	C2D_ОповещенияОператоров.IDСообщения,
	               |	C2D_ОповещенияОператоров.Operator_id
	               |ИЗ
	               |	РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Сообщения КАК C2D_Сообщения
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Диалоги КАК C2D_Диалоги
	               |			ПО C2D_Сообщения.dialog_id = C2D_Диалоги.id
	               |		ПО C2D_ОповещенияОператоров.IDСообщения = C2D_Сообщения.Id
	               |ГДЕ
	               |	НЕ C2D_Диалоги.operator_id = C2D_ОповещенияОператоров.Operator_id";
	Выборка = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из Выборка Цикл
		Запись = РегистрыСведений.C2D_ОповещенияОператоров.СоздатьМенеджерЗаписи();
		Запись.IDСообщения = стр.IDСообщения;
		 Запись.Operator_id = стр.Operator_id;
		Запись.Прочитать();
		Запись.Удалить();
	КонецЦикла; 
КонецПроцедуры

Процедура ОчиститьНеактуальныеОповещенияПриСменеОператора(diaog_id) Экспорт
	СтруктураПараметровМетода = новый Структура("diaog_id", diaog_id);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(новый УникальныйИдентификатор);
	ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.C2D_ОповещенияОператоров.ОчиститьНеактуальныеОповещенияПриСменеОператораВФоне", СтруктураПараметровМетода, ПараметрыВыполнения);	
КонецПроцедуры

Процедура ОчиститьНеактуальныеОповещенияПриСменеОператораВФоне(СтруктураПараметров, АдресВХ) Экспорт
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	C2D_ОповещенияОператоров.IDСообщения КАК IDСообщения
	               |ИЗ
	               |	РегистрСведений.C2D_Диалоги КАК C2D_Диалоги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Сообщения КАК C2D_Сообщения
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
	               |			ПО C2D_Сообщения.Id = C2D_ОповещенияОператоров.IDСообщения
	               |		ПО C2D_Диалоги.id = C2D_Сообщения.dialog_id
	               |ГДЕ
	               |	НЕ C2D_Диалоги.operator_id = C2D_ОповещенияОператоров.Operator_id
	               |	И C2D_Диалоги.id = &id";
	запрос.УстановитьПараметр("id", СтруктураПараметров.diaog_id);
	Выборка = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из Выборка Цикл
		Запись = РегистрыСведений.C2D_ОповещенияОператоров.СоздатьМенеджерЗаписи();
		Запись.IDСообщения = стр.IDСообщения;
		Запись.Прочитать();
		Запись.Удалить();
	КонецЦикла;	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
